---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange
source: html/f098856a-bf46-2f95-1e7d-20d5f9500f90.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange

Defines parameters for C-channel Sloped Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionCSlopedFlange : StructuralSectionGeneralU
```